<?php

// Напишіть функцію, яка отримує масив цілих
// чисел і повертає масив середніх значень кожного
// цілого числа та його послідовника, якщо він є.
//  Приклад:
// averages([2, -2, 2, -2, 2]), [0, 0, 0, 0]
// averages([1, 3, 5, 1, -10]), [2, 4, 3, -4.5]

    function averages($arr){
        $c = count($arr) - 1; // Бо кількість проходів на 1 менша ніж кількість елементів масива.
        // echo "$c";
        for($i = 0; $i < $c; $i++){
            $x = ($arr[$i] + $arr[$i+1]) / 2;
            $final[] = $x;
        }
        print_r($final);
    }

    averages([1, 3, 5, 1, -10]);
